### Terraform Plan Results 📋

**Environment:** Dev Account (975050047325)
**Workflow:** `Terraform - Dev Account`
**Run:** [#14](https://github.com/altanova-cloud/altanova-infrastructure/actions/runs/20462228948)

#### Terraform Plan Output

<details>
<summary>View Plan</summary>

```terraform
random_password.db_password: Refreshing state... [id=none]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.rds.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/altanova-dev-euw1-postgres/postgresql]
module.vpc.data.aws_region.current[0]: Reading...
module.vpc.data.aws_partition.current[0]: Reading...
module.deployment_role.aws_iam_role.deployment: Refreshing state... [id=DevDeployRole]
module.rds.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/altanova-dev-euw1-postgres/upgrade]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08dc7fcfa2ca5a79d]
module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=altanova-dev-euw1-postgres-20251223132130185300000001]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.data.aws_region.current[0]: Read complete after 0s [id=eu-west-1]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.rds.module.db_instance.data.aws_partition.current: Reading...
module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=975050047325]
module.deployment_role.aws_iam_role_policy.deployment: Refreshing state... [id=DevDeployRole:DevDeploymentPolicy]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-053c932aac8628797]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04685f8c8a8c85579]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-017cde5938b98c27d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0809774d91d30428f]
aws_security_group.rds: Refreshing state... [id=sg-0abf5dbde4f2ebbca]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-078c991b201e13790]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-06a0d280cd160771d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0586c6004ca43016c]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-031a6b2e8a82a443e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01c164989cbd49ba7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-071428886ac0a5ad5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-093edb48af362ec1d]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-08dc7fcfa2ca5a79d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00f062ca03bc2352e]
aws_vpc_security_group_egress_rule.rds_outbound: Refreshing state... [id=sgr-0a9580e3519231692]
aws_vpc_security_group_ingress_rule.rds_from_vpc: Refreshing state... [id=sgr-0dcb334b5d400368d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a8a146fc2e8c989c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c07ba216fced925f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0008aedfead053ac5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0720a63f9af4d8521]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-074ff12926cd2b9b7]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0a43c370ebf0363ed]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=altanova-dev-euw1-vpc]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01c164989cbd49ba71080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03eefec34e5049ad4]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=521888748]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065459ecce5dc26ee]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-078c991b201e137901080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_secretsmanager_secret.db_password will be created
  + resource "aws_secretsmanager_secret" "db_password" {
      + arn                            = (known after apply)
      + description                    = "RDS PostgreSQL master password for dev environment"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "altanova-dev-db-password-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-db-password"
          + "Project"     = "AltaNova"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-db-password"
          + "Project"     = "AltaNova"
        }
    }

  # aws_secretsmanager_secret_version.db_password will be created
  + resource "aws_secretsmanager_secret_version" "db_password" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.deployment_role.aws_iam_role.deployment will be updated in-place
  ~ resource "aws_iam_role" "deployment" {
        id                    = "DevDeployRole"
        name                  = "DevDeployRole"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "DevDeployRole"
            "Purpose"     = "GitHub Actions deployment role"
        }
      ~ tags_all              = {
          + "Project"     = "AltaNova"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deployment_role.aws_iam_role_policy.deployment will be updated in-place
  ~ resource "aws_iam_role_policy" "deployment" {
        id          = "DevDeployRole:DevDeploymentPolicy"
        name        = "DevDeploymentPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "rds:*",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:ListSecrets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = [
                            "s3:*",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (6 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:logs:eu-west-1:975050047325:log-group:/aws/vpc-flow-log/vpc-08dc7fcfa2ca5a79d"
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-08dc7fcfa2ca5a79d"
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "vpc-flow-log-to-cloudwatch-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:eu-west-1:975050047325:log-group:/aws/vpc-flow-log/vpc-08dc7fcfa2ca5a79d:*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "altanova"
      + db_subnet_group_name                  = "altanova-dev-euw1-vpc"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "altanova-dev-euw1-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "altanova-dev-euw1-postgres-20251223132130185300000001"
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = [
          + "sg-0abf5dbde4f2ebbca",
        ]

      + timeouts {}
    }

  # module.rds.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "altanova-dev-rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + unique_id             = (known after apply)
    }

  # module.rds.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "altanova-dev-rds-monitoring-role"
    }

Plan: 9 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + rds_address                = (known after apply)
  + rds_endpoint               = (known after apply)
  + rds_secret_arn             = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Next Steps:**
- Review the plan carefully
- If approved, merge this PR to trigger apply
- Dev environment will auto-apply after merge (no manual approval)
